{"-1": 0, "-3": 1, "-31m": 2, "-3m": 3, "-3m1": 4, "-4": 5, "-42m": 6, "-43m": 7, "-4m2": 8, "-6": 9, "-62m": 10, "-6m2": 11, "1": 12, "1.0": 13, "12.0": 14, "16.0": 15, "18.0": 16, "192.0": 17, "2": 18, "2.0": 19, "2/m": 20, "222": 21, "23": 22, "24.0": 23, "3": 24, "3.0": 25, "312": 26, "31m": 27, "32": 28, "32.0": 29, "321": 30, "36.0": 31, "3m": 32, "3m1": 33, "4": 34, "4.0": 35, "4/m": 36, "4/mmm": 37, "422": 38, "432": 39, "48.0": 40, "4mm": 41, "6": 42, "6.0": 43, "6/m": 44, "6/mmm": 45, "622": 46, "6mm": 47, "8.0": 48, "9.0": 49, "96.0": 50, "Aea2": 51, "Aem2": 52, "Ama2": 53, "Amm2": 54, "C12/c1": 55, "C12/m1": 56, "C121": 57, "C1c1": 58, "C1m1": 59, "C2/c2/c2/e": 60, "C2/c2/c2/m": 61, "C2/m2/c2_1/e": 62, "C2/m2/c2_1/m": 63, "C2/m2/m2/e": 64, "C2/m2/m2/m": 65, "C222": 66, "C222_1": 67, "Ccc2": 68, "Centrosymmetric": 69, "Cmc2_1": 70, "Cmm2": 71, "Enantiomorphic": 72, "F-43c": 73, "F-43m": 74, "F2/d-3": 75, "F2/d2/d2/d": 76, "F2/m-3": 77, "F2/m2/m2/m": 78, "F222": 79, "F23": 80, "F4/m-32/c": 81, "F4/m-32/m": 82, "F432": 83, "F4_1/d-32/c": 84, "F4_1/d-32/m": 85, "F4_132": 86, "Fdd2": 87, "Fmm2": 88, "I-4": 89, "I-42d": 90, "I-42m": 91, "I-43d": 92, "I-43m": 93, "I-4c2": 94, "I-4m2": 95, "I2/b2/a2/m": 96, "I2/m-3": 97, "I2/m2/m2/m": 98, "I222": 99, "I23": 100, "I2_1/a-3": 101, "I2_1/b2_1/c2_1/a": 102, "I2_1/m2_1/m2_1/a": 103, "I2_12_12_1": 104, "I2_13": 105, "I4": 106, "I4/m": 107, "I4/m-32/m": 108, "I4/m2/c2/m": 109, "I4/m2/m2/m": 110, "I422": 111, "I432": 112, "I4_1": 113, "I4_1/a": 114, "I4_1/a-32/d": 115, "I4_1/a2/c2/d": 116, "I4_1/a2/m2/d": 117, "I4_122": 118, "I4_132": 119, "I4_1cd": 120, "I4_1md": 121, "I4cm": 122, "I4mm": 123, "Iba2": 124, "Ima2": 125, "Imm2": 126, "None": 127, "P-1": 128, "P-3": 129, "P-312/c": 130, "P-312/m": 131, "P-32/c1": 132, "P-32/m1": 133, "P-4": 134, "P-42_1c": 135, "P-42_1m": 136, "P-42c": 137, "P-42m": 138, "P-43m": 139, "P-43n": 140, "P-4b2": 141, "P-4c2": 142, "P-4m2": 143, "P-4n2": 144, "P-6": 145, "P-62c": 146, "P-62m": 147, "P-6c2": 148, "P-6m2": 149, "P1": 150, "P12/c1": 151, "P12/m1": 152, "P121": 153, "P12_1/c1": 154, "P12_1/m1": 155, "P12_11": 156, "P1c1": 157, "P1m1": 158, "P2/b2/a2/n": 159, "P2/b2_1/c2_1/m": 160, "P2/c2/c2/m": 161, "P2/m-3": 162, "P2/m2/m2/m": 163, "P2/m2/n2_1/a": 164, "P2/n-3": 165, "P2/n2/n2/n": 166, "P2/n2_1/n2/a": 167, "P222": 168, "P222_1": 169, "P23": 170, "P2_1/a-3": 171, "P2_1/b2/c2_1/n": 172, "P2_1/b2_1/a2/m": 173, "P2_1/b2_1/c2_1/a": 174, "P2_1/c2/c2/a": 175, "P2_1/c2_1/c2/n": 176, "P2_1/m2/m2/a": 177, "P2_1/m2_1/m2/n": 178, "P2_1/n2_1/m2_1/a": 179, "P2_1/n2_1/n2/m": 180, "P2_12_12": 181, "P2_12_12_1": 182, "P2_13": 183, "P3": 184, "P312": 185, "P31c": 186, "P31m": 187, "P321": 188, "P3_1": 189, "P3_112": 190, "P3_121": 191, "P3_2": 192, "P3_212": 193, "P3_221": 194, "P3c1": 195, "P3m1": 196, "P4": 197, "P4/m": 198, "P4/m-32/m": 199, "P4/m2/c2/c": 200, "P4/m2/m2/m": 201, "P4/m2_1/b2/m": 202, "P4/m2_1/n2/c": 203, "P4/n": 204, "P4/n-32/n": 205, "P4/n2/b2/m": 206, "P4/n2/n2/c": 207, "P4/n2_1/c2/c": 208, "P4/n2_1/m2/m": 209, "P422": 210, "P42_12": 211, "P432": 212, "P4_1": 213, "P4_122": 214, "P4_12_12": 215, "P4_132": 216, "P4_2": 217, "P4_2/m": 218, "P4_2/m-32/n": 219, "P4_2/m2/c2/m": 220, "P4_2/m2/m2/c": 221, "P4_2/m2_1/b2/c": 222, "P4_2/m2_1/n2/m": 223, "P4_2/n": 224, "P4_2/n-32/m": 225, "P4_2/n2/b2/c": 226, "P4_2/n2/n2/m": 227, "P4_2/n2_1/c2/m": 228, "P4_2/n2_1/m2/c": 229, "P4_222": 230, "P4_22_12": 231, "P4_232": 232, "P4_2bc": 233, "P4_2cm": 234, "P4_2mc": 235, "P4_2nm": 236, "P4_3": 237, "P4_322": 238, "P4_32_12": 239, "P4_332": 240, "P4bm": 241, "P4cc": 242, "P4mm": 243, "P4nc": 244, "P6": 245, "P6/m": 246, "P6/m2/c2/c": 247, "P6/m2/m2/m": 248, "P622": 249, "P6_1": 250, "P6_122": 251, "P6_2": 252, "P6_222": 253, "P6_3": 254, "P6_3/m": 255, "P6_3/m2/c2/m": 256, "P6_3/m2/m2/c": 257, "P6_322": 258, "P6_3cm": 259, "P6_3mc": 260, "P6_4": 261, "P6_422": 262, "P6_5": 263, "P6_522": 264, "P6cc": 265, "P6mm": 266, "Pba2": 267, "Pca2_1": 268, "Pcc2": 269, "Pma2": 270, "Pmc2_1": 271, "Pmm2": 272, "Pmn2_1": 273, "Pna2_1": 274, "Pnc2": 275, "Pnn2": 276, "R-3": 277, "R-32/c": 278, "R-32/m": 279, "R3": 280, "R32": 281, "R3c": 282, "R3m": 283, "cubic": 284, "hexagonal": 285, "m": 286, "m-3": 287, "m-3m": 288, "mm2": 289, "mmm": 290, "monoclinic": 291, "non_polar": 292, "orthorhombic": 293, "tetragonal": 294, "triclinic": 295, "trigonal": 296}