{"-1": 0, "-3": 1, "-31m": 2, "-3m": 3, "-3m1": 4, "-4": 5, "-42m": 6, "-43m": 7, "-4m2": 8, "-6": 9, "-62m": 10, "-6m2": 11, "1": 12, "2": 13, "2/m": 14, "222": 15, "23": 16, "3": 17, "312": 18, "31m": 19, "32": 20, "321": 21, "3m": 22, "3m1": 23, "4": 24, "4/m": 25, "4/mmm": 26, "422": 27, "432": 28, "4mm": 29, "6": 30, "6/m": 31, "6/mmm": 32, "622": 33, "6mm": 34, "Aea2": 35, "Aem2": 36, "Ama2": 37, "Amm2": 38, "C12/c1": 39, "C12/m1": 40, "C121": 41, "C1c1": 42, "C1m1": 43, "C2/c2/c2/e": 44, "C2/c2/c2/m": 45, "C2/m2/c2_1/e": 46, "C2/m2/c2_1/m": 47, "C2/m2/m2/e": 48, "C2/m2/m2/m": 49, "C222": 50, "C222_1": 51, "Ccc2": 52, "Centrosymmetric": 53, "Cmc2_1": 54, "Cmm2": 55, "Enantiomorphic": 56, "F-43c": 57, "F-43m": 58, "F2/d-3": 59, "F2/d2/d2/d": 60, "F2/m-3": 61, "F2/m2/m2/m": 62, "F222": 63, "F23": 64, "F4/m-32/c": 65, "F4/m-32/m": 66, "F432": 67, "F4_1/d-32/c": 68, "F4_1/d-32/m": 69, "F4_132": 70, "Fdd2": 71, "Fmm2": 72, "I-4": 73, "I-42d": 74, "I-42m": 75, "I-43d": 76, "I-43m": 77, "I-4c2": 78, "I-4m2": 79, "I2/b2/a2/m": 80, "I2/m-3": 81, "I2/m2/m2/m": 82, "I222": 83, "I23": 84, "I2_1/a-3": 85, "I2_1/b2_1/c2_1/a": 86, "I2_1/m2_1/m2_1/a": 87, "I2_12_12_1": 88, "I2_13": 89, "I4": 90, "I4/m": 91, "I4/m-32/m": 92, "I4/m2/c2/m": 93, "I4/m2/m2/m": 94, "I422": 95, "I432": 96, "I4_1": 97, "I4_1/a": 98, "I4_1/a-32/d": 99, "I4_1/a2/c2/d": 100, "I4_1/a2/m2/d": 101, "I4_122": 102, "I4_132": 103, "I4_1cd": 104, "I4_1md": 105, "I4cm": 106, "I4mm": 107, "Iba2": 108, "Ima2": 109, "Imm2": 110, "None": 111, "P-1": 112, "P-3": 113, "P-312/c": 114, "P-312/m": 115, "P-32/c1": 116, "P-32/m1": 117, "P-4": 118, "P-42_1c": 119, "P-42_1m": 120, "P-42c": 121, "P-42m": 122, "P-43m": 123, "P-43n": 124, "P-4b2": 125, "P-4c2": 126, "P-4m2": 127, "P-4n2": 128, "P-6": 129, "P-62c": 130, "P-62m": 131, "P-6c2": 132, "P-6m2": 133, "P1": 134, "P12/c1": 135, "P12/m1": 136, "P121": 137, "P12_1/c1": 138, "P12_1/m1": 139, "P12_11": 140, "P1c1": 141, "P1m1": 142, "P2/b2/a2/n": 143, "P2/b2_1/c2_1/m": 144, "P2/c2/c2/m": 145, "P2/m-3": 146, "P2/m2/m2/m": 147, "P2/m2/n2_1/a": 148, "P2/n-3": 149, "P2/n2/n2/n": 150, "P2/n2_1/n2/a": 151, "P222": 152, "P222_1": 153, "P23": 154, "P2_1/a-3": 155, "P2_1/b2/c2_1/n": 156, "P2_1/b2_1/a2/m": 157, "P2_1/b2_1/c2_1/a": 158, "P2_1/c2/c2/a": 159, "P2_1/c2_1/c2/n": 160, "P2_1/m2/m2/a": 161, "P2_1/m2_1/m2/n": 162, "P2_1/n2_1/m2_1/a": 163, "P2_1/n2_1/n2/m": 164, "P2_12_12": 165, "P2_12_12_1": 166, "P2_13": 167, "P3": 168, "P312": 169, "P31c": 170, "P31m": 171, "P321": 172, "P3_1": 173, "P3_112": 174, "P3_121": 175, "P3_2": 176, "P3_212": 177, "P3_221": 178, "P3c1": 179, "P3m1": 180, "P4": 181, "P4/m": 182, "P4/m-32/m": 183, "P4/m2/c2/c": 184, "P4/m2/m2/m": 185, "P4/m2_1/b2/m": 186, "P4/m2_1/n2/c": 187, "P4/n": 188, "P4/n-32/n": 189, "P4/n2/b2/m": 190, "P4/n2/n2/c": 191, "P4/n2_1/c2/c": 192, "P4/n2_1/m2/m": 193, "P422": 194, "P42_12": 195, "P432": 196, "P4_1": 197, "P4_122": 198, "P4_12_12": 199, "P4_132": 200, "P4_2": 201, "P4_2/m": 202, "P4_2/m-32/n": 203, "P4_2/m2/c2/m": 204, "P4_2/m2/m2/c": 205, "P4_2/m2_1/b2/c": 206, "P4_2/m2_1/n2/m": 207, "P4_2/n": 208, "P4_2/n-32/m": 209, "P4_2/n2/b2/c": 210, "P4_2/n2/n2/m": 211, "P4_2/n2_1/c2/m": 212, "P4_2/n2_1/m2/c": 213, "P4_222": 214, "P4_22_12": 215, "P4_232": 216, "P4_2bc": 217, "P4_2cm": 218, "P4_2mc": 219, "P4_2nm": 220, "P4_3": 221, "P4_322": 222, "P4_32_12": 223, "P4_332": 224, "P4bm": 225, "P4cc": 226, "P4mm": 227, "P4nc": 228, "P6": 229, "P6/m": 230, "P6/m2/c2/c": 231, "P6/m2/m2/m": 232, "P622": 233, "P6_1": 234, "P6_122": 235, "P6_2": 236, "P6_222": 237, "P6_3": 238, "P6_3/m": 239, "P6_3/m2/c2/m": 240, "P6_3/m2/m2/c": 241, "P6_322": 242, "P6_3cm": 243, "P6_3mc": 244, "P6_4": 245, "P6_422": 246, "P6_5": 247, "P6_522": 248, "P6cc": 249, "P6mm": 250, "Pba2": 251, "Pca2_1": 252, "Pcc2": 253, "Pma2": 254, "Pmc2_1": 255, "Pmm2": 256, "Pmn2_1": 257, "Pna2_1": 258, "Pnc2": 259, "Pnn2": 260, "R-3": 261, "R-32/c": 262, "R-32/m": 263, "R3": 264, "R32": 265, "R3c": 266, "R3m": 267, "cubic": 268, "hexagonal": 269, "m": 270, "m-3": 271, "m-3m": 272, "mm2": 273, "mmm": 274, "monoclinic": 275, "orthorhombic": 276, "tetragonal": 277, "triclinic": 278, "trigonal": 279}